airpocket-soundman/IchiPing/firmware/projects/05_usb_cdc_emitter/frdmmcxn947_cm33_core0/pins/pin_mux.h
/*
 * Copyright 2022-2023 NXP / 2026 IchiPing project
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 * Pin routing for 05_usb_cdc_emitter.
 * USB pins on MCXN947 are dedicated (no mux), so only the debug UART pins
 * are configured here.
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

#if defined(__cplusplus)
extern "C" {
#endif

void BOARD_InitBootPins(void);
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PIN_MUX_H_ */
